class BoardView():
    """盤表示
    """


    _turns = [
        'black',
        'white'
    ]


    def __init__(self, board):
        self._board = board


    @property
    def turn(self):
        return BoardView._turns[self._board.turn]


    def stringify(self):

        # 先手、後手の持ち駒の数のリスト
        b = self._board.pieces_in_hand[0]
        w = self._board.pieces_in_hand[1]

        blocks = []
        blocks.append(f"""\
[ next {self._board.move_number} move(s) | {self.turn} | repetition 0 ]
""")
        blocks.append(f"""\

飛 角 金 銀 桂 香 歩
 {w[6]}  {w[5]}  {w[4]}  {w[3]}  {w[2]}  {w[1]} {w[0]:2}
 -  -  -  -  -  - --

""")
        blocks.append(f"""\
  9   8   7   6   5   4   3   2   1
+---+---+---+---+---+---+---+---+---+
|   |   |   |   |   |   |   |   |   | 一
+---+---+---+---+---+---+---+---+---+
|   |   |   |   |   |   |   |   |   | 二
+---+---+---+---+---+---+---+---+---+
|   |   |   |   |   |   |   |   |   | 三
+---+---+---+---+---+---+---+---+---+
|   |   |   |   |   |   |   |   |   | 四
+---+---+---+---+---+---+---+---+---+
|   |   |   |   |   |   |   |   |   | 五
+---+---+---+---+---+---+---+---+---+
|   |   |   |   |   |   |   |   |   | 六
+---+---+---+---+---+---+---+---+---+
|   |   |   |   |   |   |   |   |   | 七
+---+---+---+---+---+---+---+---+---+
|   |   |   |   |   |   |   |   |   | 八
+---+---+---+---+---+---+---+---+---+
|   |   |   |   |   |   |   |   |   | 九
+---+---+---+---+---+---+---+---+---+

""")
        blocks.append(f"""\
                 飛 角 金 銀 桂 香 歩
                  {b[6]}  {b[5]}  {b[4]}  {b[3]}  {b[2]}  {b[1]} {b[0]:2}
                  -  -  -  -  -  - -- 

""")
        return ''.join(blocks)
